app/controllers/champions_controller.rb

SELECT "champions".* FROM "champions"
---
    def index
        @champions = Champion.all

SELECT  "champions".* FROM "champions" WHERE "champions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @champions = Champion.find(params[:id])